import '../App.css'

//-----------------------------------------
//فانکشنال کامپوننت برای نمایش
//Hello, World!
//Hello, React!
//-----------------------------------------
// const HelloWorld = () => {
//     return (
//         <div>
//             <h1>Hello, World!</h1>
//             <HelloReact />
//         </div>
//     )
// }

//-----------------------------------------
//فانکشنال کامپوننت برای نمایش
//Hello, React!
//-----------------------------------------
// const HelloReact = () => {
//     return (
//         <div>
//             <h1>Hello, React!</h1>
//         </div>
//     )
// }

//-----------------------------------------
//فانکشنال کامپوننت برای نمایش پارامتر ورودی
//-----------------------------------------
const Hello = (props) => {
    return (
        <div>
            <h1>Hello, {props.name}!</h1>
        </div>
    )
}

export default Hello